# Import Pandas

In [1]:
import numpy as  np
import pandas as pd

# Creating Data Set

In [2]:
dict1 = {
    'name':['Python', 'Java', 'C', 'C++'],
    'marks':[101, 23, 35, 76],
    'city':['Mumbai', 'Goa', 'UP', 'JK']
}

# Reading Data

In [3]:
data = pd.DataFrame(dict1)
data

     name  marks    city
0  Python    101  Mumbai
1    Java     23     Goa
2       C     35      UP
3     C++     76      JK

# Export as CSV file

In [4]:
data.to_csv('dataSet.csv')

# To Remove Index

In [5]:
data.to_csv('dataSet.csv', index=False)

# To see starting of data

In [6]:
data.head(2)

     name  marks    city
0  Python    101  Mumbai
1    Java     23     Goa

# To see ending of data

In [7]:
data.tail(1)

  name  marks city
3  C++     76   JK

# Get Normal Calculation

In [8]:
data.describe()

            marks
count    4.000000
mean    58.750000
std     36.169739
min     23.000000
25%     32.000000
50%     55.500000
75%     82.250000
max    101.000000

# Change Values

In [9]:
data['marks'][1] = 50

C:\Users\Nitesh\AppData\Local\Temp/ipykernel_4528/3888981314.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['marks'][1] = 50

In [10]:
data

     name  marks    city
0  Python    101  Mumbai
1    Java     50     Goa
2       C     35      UP
3     C++     76      JK

# Series Data Creation

In [11]:
newData = pd.Series(np.random.rand(100))

In [12]:
newData

0     0.678113
1     0.152121
2     0.182741
3     0.480218
4     0.534297
        ...
95    0.830840
96    0.268012
97    0.843212
98    0.138639
99    0.149670
Length: 100, dtype: float64

In [13]:
newData.head(5)

0    0.678113
1    0.152121
2    0.182741
3    0.480218
4    0.534297
dtype: float64

In [14]:
newData.tail(5)

95    0.830840
96    0.268012
97    0.843212
98    0.138639
99    0.149670
dtype: float64

In [15]:
newData.describe()

count    100.000000
mean       0.443122
std        0.274403
min        0.011336
25%        0.204603
50%        0.401040
75%        0.678702
max        0.991993
dtype: float64

In [16]:
type(newData)

pandas.core.series.Series

# DataFrame Creation

In [17]:
newDFdata = pd.DataFrame(np.random.rand(500, 5))

In [18]:
newDFdata

            0         1         2         3         4
0    0.991478  0.028073  0.904846  0.774445  0.776498
1    0.569848  0.541742  0.420376  0.163083  0.335100
2    0.211677  0.886442  0.469790  0.483368  0.357522
3    0.794003  0.900939  0.728542  0.614606  0.455599
4    0.941557  0.686225  0.681843  0.128793  0.532262
..        ...       ...       ...       ...       ...
495  0.411973  0.931667  0.843098  0.426290  0.484073
496  0.307499  0.902851  0.672851  0.898204  0.241092
497  0.390665  0.888308  0.384030  0.638670  0.371008
498  0.573879  0.877441  0.041601  0.953375  0.679555
499  0.597567  0.052547  0.405692  0.016666  0.584776

[500 rows x 5 columns]

In [19]:
newDFdata.head(5)

          0         1         2         3         4
0  0.991478  0.028073  0.904846  0.774445  0.776498
1  0.569848  0.541742  0.420376  0.163083  0.335100
2  0.211677  0.886442  0.469790  0.483368  0.357522
3  0.794003  0.900939  0.728542  0.614606  0.455599
4  0.941557  0.686225  0.681843  0.128793  0.532262

In [20]:
newDFdata.tail(5)

            0         1         2         3         4
495  0.411973  0.931667  0.843098  0.426290  0.484073
496  0.307499  0.902851  0.672851  0.898204  0.241092
497  0.390665  0.888308  0.384030  0.638670  0.371008
498  0.573879  0.877441  0.041601  0.953375  0.679555
499  0.597567  0.052547  0.405692  0.016666  0.584776

In [21]:
newDFdata.describe()

                0           1           2           3           4
count  500.000000  500.000000  500.000000  500.000000  500.000000
mean     0.498349    0.505360    0.511630    0.519402    0.488010
std      0.280907    0.295527    0.289294    0.293651    0.281617
min      0.000294    0.000829    0.003517    0.000247    0.000712
25%      0.252120    0.246403    0.281177    0.265886    0.234668
50%      0.505466    0.515130    0.523981    0.522161    0.501482
75%      0.726290    0.746193    0.756561    0.774769    0.719094
max      0.999836    0.999629    0.998537    0.998371    0.999516

In [22]:
type(newDFdata)

pandas.core.frame.DataFrame

# Change Data without getting Warning

In [25]:
newDFdata.loc[0, 0] = 0.999999
newDFdata

            0         1         2         3         4
0    0.999999  0.028073  0.904846  0.774445  0.776498
1    0.569848  0.541742  0.420376  0.163083  0.335100
2    0.211677  0.886442  0.469790  0.483368  0.357522
3    0.794003  0.900939  0.728542  0.614606  0.455599
4    0.941557  0.686225  0.681843  0.128793  0.532262
..        ...       ...       ...       ...       ...
495  0.411973  0.931667  0.843098  0.426290  0.484073
496  0.307499  0.902851  0.672851  0.898204  0.241092
497  0.390665  0.888308  0.384030  0.638670  0.371008
498  0.573879  0.877441  0.041601  0.953375  0.679555
499  0.597567  0.052547  0.405692  0.016666  0.584776

[500 rows x 5 columns]